In [1]:
import numpy as np
import pandas as pd

In [2]:
# Provide a source of database connectivity 
from sqlalchemy import create_engine

# Working with Sqlite database in python
import sqlite3

## Data Preparation

### 1-Subject data

In [3]:
# Load data
df_subject = pd.read_csv('C:\painting\dataset\subject.csv')
df_subject.head()

   work_id     subject
0   160228  Still-Life
1   160236  Still-Life
2   160244  Still-Life
3   160252  Still-Life
4   160260  Still-Life

In [4]:
# The dimension of the dataframe
df_subject.shape

(6771, 2)

In [5]:
# Display information about the dataframe
df_subject.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6771 entries, 0 to 6770
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   work_id  6771 non-null   int64
 1   subject  6771 non-null   object
dtypes: int64(1), object(1)
memory usage: 105.9+ KB

##### Data Cleaning

In [6]:
# Check for duplicates
# Finding the total number of duplicate rows in the dataframe
df_subject.duplicated().sum()

59

In [7]:
# Remove duplicates
df_subject = df_subject.drop_duplicates()
df_subject.shape

(6712, 2)

In [8]:
# Missing Values
df_subject.isnull().sum()

work_id    0
subject    0
dtype: int64

### 2- Work

In [9]:
df_work = pd.read_csv('C:\painting\dataset\work.csv')

In [10]:
# The dimension of the dataframe
df_work.shape

(14776, 5)

In [11]:
# Display information about the dataframe
df_work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14776 entries, 0 to 14775
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   work_id    14776 non-null  int64
 1   name       14776 non-null  object
 2   artist_id  14776 non-null  int64
 3   style      13490 non-null  object
 4   museum_id  4553 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 577.3+ KB

##### Data Cleaning

In [12]:
# Check for duplicates
# Finding the total number of duplicate rows in the dataframe
df_work.duplicated().sum()

60

In [13]:
# Remove duplicates
df_work = df_work.drop_duplicates()
df_work.shape

(14716, 5)

In [14]:
# Missing Values
df_work.isnull().sum()

work_id          0
name             0
artist_id        0
style         1228
museum_id    10163
dtype: int64

### 3- Museum

In [15]:
df_museum = pd.read_csv('C:\painting\dataset\museum.csv')

In [16]:
# The dimension of the dataframe
df_museum.shape

(57, 9)

In [17]:
# Display information about the dataframe
df_museum.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  57 non-null     int64
 1   name       57 non-null     object
 2   address    57 non-null     object
 3   city       57 non-null     object
 4   state      38 non-null     object
 5   postal     50 non-null     object
 6   country    57 non-null     object
 7   phone      57 non-null     object
 8   url        57 non-null     object
dtypes: int64(1), object(8)
memory usage: 4.1+ KB

##### Data Cleaning

In [18]:
# Check for duplicates
# Finding the total number of duplicate rows in the dataframe
df_museum.duplicated().sum()

0

In [19]:
# Missing Values
df_museum.isnull().sum()

museum_id     0
name          0
address       0
city          0
state        19
postal        7
country       0
phone         0
url           0
dtype: int64

### 4- Museum_hours

In [20]:
df_museum_hrs = pd.read_csv('C:\painting\dataset\museum_hours.csv')

In [21]:
# The dimension of the dataframe
df_museum_hrs.shape

(351, 4)

In [22]:
# Display information about the dataframe
df_museum_hrs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   museum_id  351 non-null    int64
 1   day        351 non-null    object
 2   open       351 non-null    object
 3   close      351 non-null    object
dtypes: int64(1), object(3)
memory usage: 11.1+ KB

##### Data Cleaning

In [23]:
# Check for duplicates
# Finding the total number of duplicate rows in the dataframe
df_museum_hrs.duplicated().sum()

1

In [24]:
# Remove duplicates
df_museum_hrs = df_museum_hrs.drop_duplicates()
df_museum_hrs.shape

(350, 4)

In [25]:
# Missing Values
df_museum_hrs.isnull().sum()

museum_id    0
day          0
open         0
close        0
dtype: int64

### 5 -Artist

In [26]:
df_artist = pd.read_csv('C:\\painting\\dataset\\artist.csv')
df_artist.head()

,artist_id,full_name,first_name,middle_names,last_name,nationality,style,birth,death
0,500,Pierre-Auguste Renoir,Pierre,Auguste,Renoir,French,Impressionist,1841,1919
1,501,Alexandre Cabanel,Alexandre,NaN,Cabanel,French,Classicist,1823,1889
2,502,James Ensor,James,NaN,Ensor,Belgian,Expressionist,1860,1949
3,503,Maximilien Luce,Maximilien,NaN,Luce,French,Pointillist,1858,1941
4,504,August Macke,August,NaN,Macke,German,Expressionist,1887,1914

In [27]:
df_artist.shape

(421, 9)

In [28]:
df_artist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421 entries, 0 to 420
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   artist_id     421 non-null    int64
 1   full_name     421 non-null    object
 2   first_name    421 non-null    object
 3   middle_names  148 non-null    object
 4   last_name     421 non-null    object
 5   nationality   421 non-null    object
 6   style         421 non-null    object
 7   birth         421 non-null    int64
 8   death         421 non-null    int64
dtypes: int64(3), object(6)
memory usage: 29.7+ KB

##### Data Cleaning

In [29]:
# Check for duplicates
df_artist.duplicated().sum()

0

In [30]:
# missing Values
df_artist.isnull().sum()

artist_id         0
full_name         0
first_name        0
middle_names    273
last_name         0
nationality       0
style             0
birth             0
death             0
dtype: int64

### 6- Product Size

In [31]:
df_product_size = pd.read_csv('C:\painting\dataset\product_size.csv')
df_product_size.head()

   work_id size_id  sale_price  regular_price
0   160228      24          85             85
1   160228      30          95             95
2   160236      24          85             85
3   160236      30          95             95
4   160244      24          85             85

In [32]:
# The dimension of the dataframe
df_product_size.shape

(110347, 4)

In [33]:
# Display information about the dataframe
df_product_size.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110347 entries, 0 to 110346
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   work_id        110347 non-null  int64
 1   size_id        110347 non-null  object
 2   sale_price     110347 non-null  int64
 3   regular_price  110347 non-null  int64
dtypes: int64(3), object(1)
memory usage: 3.4+ MB

##### Data Cleaning

In [34]:
# Check for duplicates
# Finding the total number of duplicate rows in the dataframe
df_product_size.duplicated().sum()

687

In [35]:
# Remove duplicates
df_product_size = df_product_size.drop_duplicates()
df_product_size.shape

(109660, 4)

In [36]:
# Missing Values
df_product_size.isnull().sum()

work_id          0
size_id          0
sale_price       0
regular_price    0
dtype: int64

### 7- Image Link

In [37]:
df_image_link = pd.read_csv('C:\painting\dataset\image_link.csv')
df_image_link.head()

,work_id,url,thumbnail_small_url,thumbnail_large_url
0,181978,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
1,173188,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
2,194065,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
3,129337,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
4,141073,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...

In [38]:
df_image_link.shape

(14775, 4)

In [39]:
df_image_link.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14775 entries, 0 to 14774
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   work_id              14775 non-null  int64
 1   url                  14775 non-null  object
 2   thumbnail_small_url  14773 non-null  object
 3   thumbnail_large_url  14773 non-null  object
dtypes: int64(1), object(3)
memory usage: 461.8+ KB

##### Data Cleaning

In [40]:
# Check for duplicates
df_image_link.duplicated().sum()

60

In [41]:
df_image_link = df_image_link.drop_duplicates()
df_image_link.shape

(14715, 4)

In [42]:
# Missing Values
df_image_link.isnull().sum()

work_id                0
url                    0
thumbnail_small_url    2
thumbnail_large_url    2
dtype: int64

In [43]:
# Remove all row in specified columns where al least 1 value is missing
df_image_link.loc[:, ['thumbnail_small_url','thumbnail_large_url']].dropna(inplace=True)

In [44]:
df_image_link.isnull().sum()

work_id                0
url                    0
thumbnail_small_url    2
thumbnail_large_url    2
dtype: int64

In [45]:
# Remove all row in specified columns where al least 1 value is missing
specified_columns = ['thumbnail_small_url', 'thumbnail_large_url']

# Remove rows with missing values in specified columns
df_image_link.dropna(subset=specified_columns, inplace=True)

# Check for missing values again to confirm
print(df_image_link.isnull().sum())

work_id                0
url                    0
thumbnail_small_url    0
thumbnail_large_url    0
dtype: int64

### 8- Canvas Size

In [46]:
df_canvas_size = pd.read_csv('C:\painting\dataset\canvas_size.csv')
df_canvas_size.head()

   size_id  width  height          label
0       20     20     NaN  20" Long Edge
1       24     24     NaN  24" Long Edge
2       30     30     NaN  30" Long Edge
3       36     36     NaN  36" Long Edge
4       40     40     NaN  40" Long Edge

In [47]:
df_canvas_size.shape

(200, 4)

In [48]:
df_canvas_size.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   size_id  200 non-null    int64
 1   width    200 non-null    int64
 2   height   193 non-null    float64
 3   label    200 non-null    object
dtypes: float64(1), int64(2), object(1)
memory usage: 6.4+ KB

##### Data Cleaning

In [49]:
# Check for duplicates
df_canvas_size.duplicated().sum()

0

In [50]:
# Check for missing values
df_canvas_size.isnull().sum()

size_id    0
width      0
height     7
label      0
dtype: int64

# SQL Data Analysis

In [51]:
import mysql.connector

In [52]:


# Initialize a new engine that can interface with the SQLite database
engine = create_engine('sqlite:///paintings.db')

In [53]:
# Connect to the database
conn = engine.connect()

In [54]:
# Write Dataframes to SQL Database
df_artist.to_sql('artist', engine, if_exists='replace', index=False)
df_canvas_size.to_sql('canvas_size', engine, if_exists='replace', index=False)
df_image_link.to_sql('image_link', engine, if_exists='replace', index=False)
df_museum.to_sql('museum', engine, if_exists='replace', index=False)
df_museum_hrs.to_sql('museum_hours', engine, if_exists='replace', index=False)
df_product_size.to_sql('product_size', engine, if_exists='replace', index=False)
df_subject.to_sql('subject', engine, if_exists='replace', index=False)
df_work.to_sql('work', engine, if_exists='replace', index=False)

14716

In [55]:
# Load sql extension in Ipython environment
%load_ext sql

In [56]:
# connect to Sqlite database : paintings
%sql sqlite:///paintings.db

# SQL Queries

In [57]:
%%sql
-- List alltables in the database
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///paintings.db
Done.

[('artist',),
 ('canvas_size',),
 ('image_link',),
 ('museum',),
 ('museum_hours',),
 ('product_size',),
 ('subject',),
 ('work',)]

# 1- Fetch all the paintings which are not displayed at any museums

In [58]:
%%sql
SELECT * 
FROM work
WHERE museum_id IS NULL
LIMIT 10;

 * sqlite:///paintings.db
Done.

[(125752, 'Arabian Horses at Pasture', 757, 'Baroque', None),
 (125818, 'Count Halm on His Basedow Estate', 757, 'Baroque', None),
 (125763, 'Napoleon Before the Burning City of Smolensk', 757, 'Baroque', None),
 (125774, 'Peasants Resting in the Field', 757, 'Baroque', None),
 (125785, 'Portrait Oberleutnant Theodor Von Klein', 757, 'Baroque', None),
 (125796, 'The Rescue of Count Munnich', 757, 'Baroque', None),
 (125807, 'The Stable Yard', 757, 'Baroque', None),
 (24532, 'Jacob A. Stamler Departing Le Havre', 563, None, None),
 (124470, 'Kaleda off Le Havre', 563, None, None),
 (124479, 'R. Bell &amp; Co. Steamship Bothal in a Heavy Swell', 563, None, None)]

# 2- Are there any museums without any paintings?

In [59]:
%%sql
SELECT *
FROM museum AS m
LEFT JOIN work AS w
    ON m.museum_id = w.museum_id
    WHERE w.museum_id IS NULL;

 * sqlite:///paintings.db
Done.

[]

# 3- How many painting have asking price which more than their regular price?

In [60]:
%%sql
SELECT *
FROM product_size
WHERE sale_price > regular_price;

 * sqlite:///paintings.db
Done.

[]

# 4- Identify the paintings whose asking price is less than 50% of its regular price

In [61]:
%%sql
SELECT * 
FROM product_size
WHERE sale_price < (regular_price*0.5)
LIMIT 20;

 * sqlite:///paintings.db
Done.

[(31780, '36', 10, 125),
 (31780, '30', 10, 95),
 (198417, '36', 30, 125),
 (198417, '30', 30, 95),
 (31974, '24', 30, 85),
 (17351, '24', 10, 85),
 (17351, '30', 10, 95),
 (17351, '36', 10, 125),
 (30947, '3024', 285, 575),
 (30947, '3226', 305, 645),
 (23710, '30', 20, 95),
 (23710, '24', 20, 85),
 (20084, '6040', 585, 1245),
 (133971, '#VALUE!', 1025, 2235),
 (28259, '30', 40, 95),
 (28259, '24', 40, 85),
 (28261, '24', 40, 85),
 (28261, '30', 40, 95),
 (28273, '24', 40, 85),
 (28273, '30', 40, 95)]

# 5- Which canva size costs the most?

In [77]:
%%sql
SELECT 
    cs.label AS canvas,
    ps.sale_price
FROM (
    SELECT 
        *,
        RANK() OVER (ORDER BY sale_price DESC) AS rnk 
    FROM 
        product_size
) AS ps
JOIN 
    canvas_size AS cs ON cs.size_id = ps.size_id
WHERE 
    ps.rnk = 1;

 * sqlite:///paintings.db
Done.

[('48" x 96"(122 cm x 244 cm)', 1115)]

# 6- Fetch the most 10 famous painting subject

In [64]:
%%sql
SELECT 
  subject,
  COUNT(*) AS nr_of_paintings
FROM subject
GROUP BY 1
ORDER BY nr_of_paintings DESC
LIMIT 10;

 * sqlite:///paintings.db
Done.

[('Portraits', 1070),
 ('Nude', 525),
 ('Landscape Art', 495),
 ('Rivers/Lakes', 480),
 ('Flowers', 457),
 ('Abstract/Modern Art', 399),
 ('Still-Life', 395),
 ('Seascapes', 323),
 ('Marine Art/Maritime', 268),
 ('Horses', 265)]

# 7- Identify the museums which are open both Sunday and Monday

### Display museum name and city

In [65]:
%%sql
SELECT DISTINCT 
    m.name AS museum_name,
    m.city,
    m.state,
    m.country
FROM 
    museum_hours mh
JOIN 
    museum m ON m.museum_id = mh.museum_id
WHERE 
    mh.day = 'Sunday'
AND EXISTS (
    SELECT 1
    FROM museum_hours mh2
    WHERE mh2.museum_id = mh.museum_id
    AND mh2.day = 'Monday'
);

 * sqlite:///paintings.db
Done.

[('The Museum of Modern Art', 'New York', 'NY', 'USA'),
 ('Pushkin State Museum of Fine Arts', 'Moscow', None, 'Russia'),
 ('National Gallery of Victoria', 'Melbourne', 'Victoria', 'Australia'),
 ('The Metropolitan Museum of Art', 'New York', 'NY', 'USA'),
 ('Museum of Grenoble', '38000', 'Grenoble', 'France'),
 ('Nelson-Atkins Museum of Art', 'Kansas City', 'MO', 'USA'),
 ('Muse du Louvre', '75001', 'Paris', 'France'),
 ('National Maritime Museum', 'London', 'SE10 9NF', 'United Kingdom'),
 ('Museum of Fine Arts Boston', 'Boston', 'MA', 'USA'),
 ('Rijksmuseum', 'Amsterdam', None, 'Netherlands'),
 ('Israel Museum', 'Jerusalem', None, 'Israel'),
 ('National Gallery of Art', 'Washington', 'DC', 'USA'),
 ('National Gallery', 'London', 'England', 'UK'),
 ('Mauritshuis Museum', 'Den Haag', None, 'Netherlands'),
 ('The Prado Museum', 'Madrid', None, 'Spain'),
 ('The Barnes Foundation', 'Philadelphia', 'PA', 'USA'),
 ('Van Gogh Museum', 'Amsterdam', None, 'Netherlands'),
 ('Los Angeles County Museum of Art', 'Los Angeles', 'CA', 'USA'),
 ('Solomon R. Guggenheim Museum', 'New York', 'NY', 'USA'),
 ('The Tate Gallery', 'London', 'England', 'UK'),
 ('Museum of Fine Arts of Nancy', 'Nancy', None, 'France'),
 ('Smithsonian American Art Museum', 'Washington', 'DC', 'USA'),
 ('Philadelphia Museum of Art', 'Philadelphia', 'PA', 'USA'),
 ('The Art Institute of Chicago', 'Chicago', 'IL', 'USA'),
 ('Army Museum', 'Paris', None, 'France'),
 ('National Gallery Prague', 'Nov Mst', None, 'Czechia'),
 ('Norton Simon Museum', 'Pasadena', 'CA', 'USA'),
 ('Courtauld Gallery', 'Stran', 'London', 'UK')]

# 8- How many museums are open every single day?

In [66]:
%%sql
SELECT COUNT(1)
FROM (
    SELECT museum_id, COUNT(1)
    FROM museum_hours
    GROUP BY museum_id
    HAVING COUNT(DISTINCT day) = 7
) x;

 * sqlite:///paintings.db
Done.

[(17,)]

# 9- Which are the top most popular museums?

In [67]:
%%sql
SELECT  *
FROM(
  SELECT 
    m.name AS museum_name,
    COUNT(w.work_id) AS nr_of_paintings
  FROM museum AS m
  JOIN work AS w
    ON m.museum_id = w.museum_id
  GROUP BY 1) AS museum_painting_counts
ORDER BY nr_of_paintings DESC
LIMIT 5;

 * sqlite:///paintings.db
Done.

[('The Metropolitan Museum of Art', 939),
 ('Rijksmuseum', 452),
 ('National Gallery', 423),
 ('National Gallery of Art', 375),
 ('The Barnes Foundation', 350)]

# 10- Who are the top 10 most popular artist?

#### Populariy is based on most number of paintings done by an artist

In [68]:
%%sql
SELECT *
FROM (
  SELECT 
    a.full_name AS artist_name,
    COUNT(w.work_id) AS nr_of_paintings
  FROM artist AS a
  JOIN work AS w
    ON a.artist_id = w.artist_id
  GROUP BY 1)AS artist_painting_counts
ORDER BY nr_of_paintings DESC
LIMIT 10;

 * sqlite:///paintings.db
Done.

[('Pierre-Auguste Renoir', 469),
 ('Claude Monet', 378),
 ('Vincent Van Gogh', 308),
 ('Maurice Utrillo', 253),
 ('Albert Marquet', 233),
 ('Henri Lebasque', 200),
 ('Camille Pissarro', 188),
 ('Louis Valtat', 184),
 ('Maximilien Luce', 174),
 ('Henri Le Sidaner', 159)]

# 11- Display the 3 least popular canvas sizes

In [69]:
%%sql
SELECT *
FROM (
  SELECT
    c.label as canvas_label,
    COUNT(w.work_id) AS nr_of_paintings
  FROM canvas_size AS c
  JOIN product_size AS p
    ON c.size_id = p.size_id
  JOIN work AS w
    ON p.work_id = w.work_id
  GROUP BY 1
)AS canvas_label_painting_counts
ORDER BY nr_of_paintings ASC
LIMIT 3;

 * sqlite:///paintings.db
Done.

[('24" x 29"(61 cm x 74 cm)', 1),
 ('32" x 18"(81 cm x 46 cm)', 1),
 ('32" x 46"(81 cm x 117 cm)', 1)]

# 12-Which museum is open for the longest  during a day?

### Display museum name, city and hours open and which day

In [70]:
%%sql
SELECT 
    m.name AS museum_name,
    m.city,
    mh.day,
    CASE
        WHEN mh.close > mh.open THEN mh.close - mh.open
        ELSE (24 - mh.open) + mh.close
    END AS hrs_open
FROM museum_hours AS mh
JOIN museum AS m
    ON mh.museum_id = m.museum_id
ORDER BY hrs_open DESC
LIMIT 1;

 * sqlite:///paintings.db
Done.

[('The Metropolitan Museum of Art', 'New York', 'Friday', 23)]

# 13- Which museum has the most painting style?

In [71]:
%%sql
SELECT 
    m.name,
    COUNT(w.style) AS nr_of_painting_styles
FROM work AS w
JOIN museum AS m
    ON w.museum_id = m.museum_id
GROUP BY 1
ORDER BY nr_of_painting_styles DESC
LIMIT 1;

 * sqlite:///paintings.db
Done.

[('The Metropolitan Museum of Art', 851)]

# 14- Identify the top 5 artists whose paintings are displayed in multiple countries

In [72]:
%%sql
SELECT 
  a.full_name AS artist_name,
  COUNT(*) AS nr_of_countries_displayed
FROM museum AS m
JOIN work AS w
  ON m.museum_id = w.museum_id
JOIN artist AS a
  ON w.artist_id = a.artist_id
GROUP BY 1
HAVING nr_of_countries_displayed > 2
ORDER BY COUNT(*) DESC
LIMIT 5;

 * sqlite:///paintings.db
Done.

[('Pierre-Auguste Renoir', 272),
 ('Claude Monet', 192),
 ('Vincent Van Gogh', 142),
 ('Paul Czanne', 125),
 ('Camille Pissarro', 95)]

# 15- Which country has the 5th highest nr. of paintings?

In [73]:
%%sql
SELECT 
  m.country,
  COUNT(*) AS nr_of_paintings
FROM museum AS m
JOIN work AS w
  ON m.museum_id = w.museum_id
GROUP BY 1
ORDER BY COUNT(*) DESC
LIMIT 1
OFFSET 4;

 * sqlite:///paintings.db
Done.

[('Spain', 196)]

# 16- Which are the 3 most popular and 3 least popular styles?

In [74]:
%%sql
SELECT style, nr_of_paintings, remarks
FROM (
    SELECT 
        style,
        COUNT(*) AS nr_of_paintings,
        'Most Popular' AS remarks
    FROM work
    GROUP BY style
    ORDER BY COUNT(*) DESC
    LIMIT 3
) AS most_popular
UNION ALL
SELECT style, nr_of_paintings, remarks
FROM (
    SELECT 
        style,
        COUNT(*) AS nr_of_paintings,
        'Least Popular' AS remarks
    FROM work
    GROUP BY style
    ORDER BY COUNT(*) ASC
    LIMIT 3
) AS least_popular;

 * sqlite:///paintings.db
Done.

[('Impressionism', 3078, 'Most Popular'),
 ('Post-Impressionism', 1672, 'Most Popular'),
 (None, 1228, 'Most Popular'),
 ('Japanese Art', 70, 'Least Popular'),
 ('Art Nouveau', 108, 'Least Popular'),
 ('Avant-Garde', 146, 'Least Popular')]

# 17- Identify the artist and the museum where the most expensive and least expensive painting is placed

#### Display the artist name, sale_price, painting name, museum name, museum city and canvas label

In [75]:
%%sql
WITH cte AS (
    SELECT 
        *,
        RANK() OVER (ORDER BY sale_price DESC) AS rnk_desc,
        RANK() OVER (ORDER BY sale_price) AS rnk_asc
    FROM product_size
)
SELECT 
    w.name AS painting,
    cte.sale_price,
    a.full_name AS artist,
    m.name AS museum,
    m.city,
    cz.label AS canvas
FROM 
    cte
JOIN 
    work w ON w.work_id = cte.work_id
JOIN 
    museum m ON m.museum_id = w.museum_id
JOIN 
    artist a ON a.artist_id = w.artist_id
JOIN 
    canvas_size cz ON cz.size_id = CAST(cte.size_id AS NUMERIC)
WHERE 
    cte.rnk_desc = 1 OR cte.rnk_asc = 1;

 * sqlite:///paintings.db
Done.

[('Portrait of Madame Labille-Guyard and Her Pupils', 10, 'Adlade Labille-Guiard', 'The Metropolitan Museum of Art', 'New York', '30" Long Edge'),
 ('Portrait of Madame Labille-Guyard and Her Pupils', 10, 'Adlade Labille-Guiard', 'The Metropolitan Museum of Art', 'New York', '36" Long Edge'),
 ('Fortuna', 1115, 'Peter Paul Rubens', 'The Prado Museum', 'Madrid', '48" x 96"(122 cm x 244 cm)')]

# 18- Which artist has the most no of Portraits paintings outside USA?

### Display artist name, no of paintings and the artist nationality.
	select full_name as artist_name, nationality, no_of_paintings

In [76]:
%%sql
SELECT 
    full_name AS artist_name,
    nationality,
    no_of_paintings
FROM (
    SELECT 
        a.full_name,
        a.nationality,
        COUNT(1) AS no_of_paintings,
        RANK() OVER (ORDER BY COUNT(1) DESC) AS rnk
    FROM 
        work w
    JOIN 
        artist a ON a.artist_id = w.artist_id
    JOIN 
        subject s ON s.work_id = w.work_id
    JOIN 
        museum m ON m.museum_id = w.museum_id
    WHERE 
        s.subject = 'Portraits'
        AND m.country != 'USA'
    GROUP BY 
        a.full_name,
        a.nationality
) x
WHERE 
    rnk = 1;

 * sqlite:///paintings.db
Done.

[('Jan Willem Pieneman', 'Dutch', 14), ('Vincent Van Gogh', 'Dutch', 14)]